Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hsmc.h
/**
 * \brief Component description for HSMC
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_HSMC_COMPONENT_H_
#define _SAMRH71_HSMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HSMC                                         */
/* ************************************************************************** */

/* -------- HSMC_SETUP0 : (HSMC Offset: 0x00) (R/W 32) HSMC Setup Register (CS_number = 0) -------- */
#define HSMC_SETUP0_NWE_SETUP_Pos             _U_(0)                                               /**< (HSMC_SETUP0) NWE Setup Length Position */
#define HSMC_SETUP0_NWE_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP0_NWE_SETUP_Pos)             /**< (HSMC_SETUP0) NWE Setup Length Mask */
#define HSMC_SETUP0_NWE_SETUP(value)          (HSMC_SETUP0_NWE_SETUP_Msk & ((value) << HSMC_SETUP0_NWE_SETUP_Pos))
#define HSMC_SETUP0_NCS_WR_SETUP_Pos          _U_(8)                                               /**< (HSMC_SETUP0) NCS Setup Length in WRITE Access Position */
#define HSMC_SETUP0_NCS_WR_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP0_NCS_WR_SETUP_Pos)          /**< (HSMC_SETUP0) NCS Setup Length in WRITE Access Mask */
#define HSMC_SETUP0_NCS_WR_SETUP(value)       (HSMC_SETUP0_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP0_NCS_WR_SETUP_Pos))
#define HSMC_SETUP0_NRD_SETUP_Pos             _U_(16)                                              /**< (HSMC_SETUP0) NRD Setup Length Position */
#define HSMC_SETUP0_NRD_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP0_NRD_SETUP_Pos)             /**< (HSMC_SETUP0) NRD Setup Length Mask */
#define HSMC_SETUP0_NRD_SETUP(value)          (HSMC_SETUP0_NRD_SETUP_Msk & ((value) << HSMC_SETUP0_NRD_SETUP_Pos))
#define HSMC_SETUP0_NCS_RD_SETUP_Pos          _U_(24)                                              /**< (HSMC_SETUP0) NCS Setup Length in READ Access Position */
#define HSMC_SETUP0_NCS_RD_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP0_NCS_RD_SETUP_Pos)          /**< (HSMC_SETUP0) NCS Setup Length in READ Access Mask */
#define HSMC_SETUP0_NCS_RD_SETUP(value)       (HSMC_SETUP0_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP0_NCS_RD_SETUP_Pos))
#define HSMC_SETUP0_Msk                       _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP0) Register Mask  */


/* -------- HSMC_PULSE0 : (HSMC Offset: 0x04) (R/W 32) HSMC Pulse Register (CS_number = 0) -------- */
#define HSMC_PULSE0_NWE_PULSE_Pos             _U_(0)                                               /**< (HSMC_PULSE0) NWE Pulse Length Position */
#define HSMC_PULSE0_NWE_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE0_NWE_PULSE_Pos)             /**< (HSMC_PULSE0) NWE Pulse Length Mask */
#define HSMC_PULSE0_NWE_PULSE(value)          (HSMC_PULSE0_NWE_PULSE_Msk & ((value) << HSMC_PULSE0_NWE_PULSE_Pos))
#define HSMC_PULSE0_NCS_WR_PULSE_Pos          _U_(8)                                               /**< (HSMC_PULSE0) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE0_NCS_WR_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE0_NCS_WR_PULSE_Pos)          /**< (HSMC_PULSE0) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE0_NCS_WR_PULSE(value)       (HSMC_PULSE0_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE0_NCS_WR_PULSE_Pos))
#define HSMC_PULSE0_NRD_PULSE_Pos             _U_(16)                                              /**< (HSMC_PULSE0) NRD Pulse Length Position */
#define HSMC_PULSE0_NRD_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE0_NRD_PULSE_Pos)             /**< (HSMC_PULSE0) NRD Pulse Length Mask */
#define HSMC_PULSE0_NRD_PULSE(value)          (HSMC_PULSE0_NRD_PULSE_Msk & ((value) << HSMC_PULSE0_NRD_PULSE_Pos))
#define HSMC_PULSE0_NCS_RD_PULSE_Pos          _U_(24)                                              /**< (HSMC_PULSE0) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE0_NCS_RD_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE0_NCS_RD_PULSE_Pos)          /**< (HSMC_PULSE0) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE0_NCS_RD_PULSE(value)       (HSMC_PULSE0_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE0_NCS_RD_PULSE_Pos))
#define HSMC_PULSE0_Msk                       _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE0) Register Mask  */


/* -------- HSMC_CYCLE0 : (HSMC Offset: 0x08) (R/W 32) HSMC Cycle Register (CS_number = 0) -------- */
#define HSMC_CYCLE0_NWE_CYCLE_Pos             _U_(0)                                               /**< (HSMC_CYCLE0) Total Write Cycle Length Position */
#define HSMC_CYCLE0_NWE_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE0_NWE_CYCLE_Pos)            /**< (HSMC_CYCLE0) Total Write Cycle Length Mask */
#define HSMC_CYCLE0_NWE_CYCLE(value)          (HSMC_CYCLE0_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE0_NWE_CYCLE_Pos))
#define HSMC_CYCLE0_NRD_CYCLE_Pos             _U_(16)                                              /**< (HSMC_CYCLE0) Total Read Cycle Length Position */
#define HSMC_CYCLE0_NRD_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE0_NRD_CYCLE_Pos)            /**< (HSMC_CYCLE0) Total Read Cycle Length Mask */
#define HSMC_CYCLE0_NRD_CYCLE(value)          (HSMC_CYCLE0_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE0_NRD_CYCLE_Pos))
#define HSMC_CYCLE0_Msk                       _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE0) Register Mask  */


/* -------- HSMC_MODE0 : (HSMC Offset: 0x0C) (R/W 32) HSMC Mode Register (CS_number = 0) -------- */
#define HSMC_MODE0_READ_MODE_Pos              _U_(0)                                               /**< (HSMC_MODE0) Read Mode Position */
#define HSMC_MODE0_READ_MODE_Msk              (_U_(0x1) << HSMC_MODE0_READ_MODE_Pos)               /**< (HSMC_MODE0) Read Mode Mask */
#define HSMC_MODE0_READ_MODE(value)           (HSMC_MODE0_READ_MODE_Msk & ((value) << HSMC_MODE0_READ_MODE_Pos))
#define HSMC_MODE0_WRITE_MODE_Pos             _U_(1)                                               /**< (HSMC_MODE0) Write Mode Position */
#define HSMC_MODE0_WRITE_MODE_Msk             (_U_(0x1) << HSMC_MODE0_WRITE_MODE_Pos)              /**< (HSMC_MODE0) Write Mode Mask */
#define HSMC_MODE0_WRITE_MODE(value)          (HSMC_MODE0_WRITE_MODE_Msk & ((value) << HSMC_MODE0_WRITE_MODE_Pos))
#define HSMC_MODE0_RMW_ENABLE_Pos             _U_(2)                                               /**< (HSMC_MODE0) Read-Modify Write enable Position */
#define HSMC_MODE0_RMW_ENABLE_Msk             (_U_(0x1) << HSMC_MODE0_RMW_ENABLE_Pos)              /**< (HSMC_MODE0) Read-Modify Write enable Mask */
#define HSMC_MODE0_RMW_ENABLE(value)          (HSMC_MODE0_RMW_ENABLE_Msk & ((value) << HSMC_MODE0_RMW_ENABLE_Pos))
#define HSMC_MODE0_EXNW_MODE_Pos              _U_(4)                                               /**< (HSMC_MODE0) NWAIT Mode Position */
#define HSMC_MODE0_EXNW_MODE_Msk              (_U_(0x3) << HSMC_MODE0_EXNW_MODE_Pos)               /**< (HSMC_MODE0) NWAIT Mode Mask */
#define HSMC_MODE0_EXNW_MODE(value)           (HSMC_MODE0_EXNW_MODE_Msk & ((value) << HSMC_MODE0_EXNW_MODE_Pos))
#define   HSMC_MODE0_EXNW_MODE_DISABLED_Val   _U_(0x0)                                             /**< (HSMC_MODE0) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   HSMC_MODE0_EXNW_MODE_FROZEN_Val     _U_(0x2)                                             /**< (HSMC_MODE0) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE0_EXNW_MODE_READY_Val      _U_(0x3)                                             /**< (HSMC_MODE0) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE0_EXNW_MODE_DISABLED         (HSMC_MODE0_EXNW_MODE_DISABLED_Val << HSMC_MODE0_EXNW_MODE_Pos) /**< (HSMC_MODE0) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define HSMC_MODE0_EXNW_MODE_FROZEN           (HSMC_MODE0_EXNW_MODE_FROZEN_Val << HSMC_MODE0_EXNW_MODE_Pos) /**< (HSMC_MODE0) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE0_EXNW_MODE_READY            (HSMC_MODE0_EXNW_MODE_READY_Val << HSMC_MODE0_EXNW_MODE_Pos) /**< (HSMC_MODE0) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE0_DBW_Pos                    _U_(8)                                               /**< (HSMC_MODE0) Data Bus Width Position */
#define HSMC_MODE0_DBW_Msk                    (_U_(0x3) << HSMC_MODE0_DBW_Pos)                     /**< (HSMC_MODE0) Data Bus Width Mask */
#define HSMC_MODE0_DBW(value)                 (HSMC_MODE0_DBW_Msk & ((value) << HSMC_MODE0_DBW_Pos))
#define   HSMC_MODE0_DBW_8_BIT_Val            _U_(0x0)                                             /**< (HSMC_MODE0) 8-bit Data Bus  */
#define   HSMC_MODE0_DBW_16_BIT_Val           _U_(0x1)                                             /**< (HSMC_MODE0) 16-bit Data Bus  */
#define   HSMC_MODE0_DBW_32_BIT_Val           _U_(0x2)                                             /**< (HSMC_MODE0) 32-bit Data Bus  */
#define HSMC_MODE0_DBW_8_BIT                  (HSMC_MODE0_DBW_8_BIT_Val << HSMC_MODE0_DBW_Pos)     /**< (HSMC_MODE0) 8-bit Data Bus Position  */
#define HSMC_MODE0_DBW_16_BIT                 (HSMC_MODE0_DBW_16_BIT_Val << HSMC_MODE0_DBW_Pos)    /**< (HSMC_MODE0) 16-bit Data Bus Position  */
#define HSMC_MODE0_DBW_32_BIT                 (HSMC_MODE0_DBW_32_BIT_Val << HSMC_MODE0_DBW_Pos)    /**< (HSMC_MODE0) 32-bit Data Bus Position  */
#define HSMC_MODE0_Msk                        _U_(0x00000337)                                      /**< (HSMC_MODE0) Register Mask  */


/* -------- HSMC_SETUP1 : (HSMC Offset: 0x10) (R/W 32) HSMC Setup Register (CS_number = 1) -------- */
#define HSMC_SETUP1_NWE_SETUP_Pos             _U_(0)                                               /**< (HSMC_SETUP1) NWE Setup Length Position */
#define HSMC_SETUP1_NWE_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP1_NWE_SETUP_Pos)             /**< (HSMC_SETUP1) NWE Setup Length Mask */
#define HSMC_SETUP1_NWE_SETUP(value)          (HSMC_SETUP1_NWE_SETUP_Msk & ((value) << HSMC_SETUP1_NWE_SETUP_Pos))
#define HSMC_SETUP1_NCS_WR_SETUP_Pos          _U_(8)                                               /**< (HSMC_SETUP1) NCS Setup Length in WRITE Access Position */
#define HSMC_SETUP1_NCS_WR_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP1_NCS_WR_SETUP_Pos)          /**< (HSMC_SETUP1) NCS Setup Length in WRITE Access Mask */
#define HSMC_SETUP1_NCS_WR_SETUP(value)       (HSMC_SETUP1_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP1_NCS_WR_SETUP_Pos))
#define HSMC_SETUP1_NRD_SETUP_Pos             _U_(16)                                              /**< (HSMC_SETUP1) NRD Setup Length Position */
#define HSMC_SETUP1_NRD_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP1_NRD_SETUP_Pos)             /**< (HSMC_SETUP1) NRD Setup Length Mask */
#define HSMC_SETUP1_NRD_SETUP(value)          (HSMC_SETUP1_NRD_SETUP_Msk & ((value) << HSMC_SETUP1_NRD_SETUP_Pos))
#define HSMC_SETUP1_NCS_RD_SETUP_Pos          _U_(24)                                              /**< (HSMC_SETUP1) NCS Setup Length in READ Access Position */
#define HSMC_SETUP1_NCS_RD_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP1_NCS_RD_SETUP_Pos)          /**< (HSMC_SETUP1) NCS Setup Length in READ Access Mask */
#define HSMC_SETUP1_NCS_RD_SETUP(value)       (HSMC_SETUP1_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP1_NCS_RD_SETUP_Pos))
#define HSMC_SETUP1_Msk                       _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP1) Register Mask  */


