Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hsmc.h
/* -------- HSMC_PULSE1 : (HSMC Offset: 0x14) (R/W 32) HSMC Pulse Register (CS_number = 1) -------- */
#define HSMC_PULSE1_NWE_PULSE_Pos             _U_(0)                                               /**< (HSMC_PULSE1) NWE Pulse Length Position */
#define HSMC_PULSE1_NWE_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE1_NWE_PULSE_Pos)             /**< (HSMC_PULSE1) NWE Pulse Length Mask */
#define HSMC_PULSE1_NWE_PULSE(value)          (HSMC_PULSE1_NWE_PULSE_Msk & ((value) << HSMC_PULSE1_NWE_PULSE_Pos))
#define HSMC_PULSE1_NCS_WR_PULSE_Pos          _U_(8)                                               /**< (HSMC_PULSE1) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE1_NCS_WR_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE1_NCS_WR_PULSE_Pos)          /**< (HSMC_PULSE1) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE1_NCS_WR_PULSE(value)       (HSMC_PULSE1_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE1_NCS_WR_PULSE_Pos))
#define HSMC_PULSE1_NRD_PULSE_Pos             _U_(16)                                              /**< (HSMC_PULSE1) NRD Pulse Length Position */
#define HSMC_PULSE1_NRD_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE1_NRD_PULSE_Pos)             /**< (HSMC_PULSE1) NRD Pulse Length Mask */
#define HSMC_PULSE1_NRD_PULSE(value)          (HSMC_PULSE1_NRD_PULSE_Msk & ((value) << HSMC_PULSE1_NRD_PULSE_Pos))
#define HSMC_PULSE1_NCS_RD_PULSE_Pos          _U_(24)                                              /**< (HSMC_PULSE1) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE1_NCS_RD_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE1_NCS_RD_PULSE_Pos)          /**< (HSMC_PULSE1) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE1_NCS_RD_PULSE(value)       (HSMC_PULSE1_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE1_NCS_RD_PULSE_Pos))
#define HSMC_PULSE1_Msk                       _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE1) Register Mask  */


/* -------- HSMC_CYCLE1 : (HSMC Offset: 0x18) (R/W 32) HSMC Cycle Register (CS_number = 1) -------- */
#define HSMC_CYCLE1_NWE_CYCLE_Pos             _U_(0)                                               /**< (HSMC_CYCLE1) Total Write Cycle Length Position */
#define HSMC_CYCLE1_NWE_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE1_NWE_CYCLE_Pos)            /**< (HSMC_CYCLE1) Total Write Cycle Length Mask */
#define HSMC_CYCLE1_NWE_CYCLE(value)          (HSMC_CYCLE1_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE1_NWE_CYCLE_Pos))
#define HSMC_CYCLE1_NRD_CYCLE_Pos             _U_(16)                                              /**< (HSMC_CYCLE1) Total Read Cycle Length Position */
#define HSMC_CYCLE1_NRD_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE1_NRD_CYCLE_Pos)            /**< (HSMC_CYCLE1) Total Read Cycle Length Mask */
#define HSMC_CYCLE1_NRD_CYCLE(value)          (HSMC_CYCLE1_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE1_NRD_CYCLE_Pos))
#define HSMC_CYCLE1_Msk                       _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE1) Register Mask  */


/* -------- HSMC_MODE1 : (HSMC Offset: 0x1C) (R/W 32) HSMC Mode Register (CS_number = 1) -------- */
#define HSMC_MODE1_READ_MODE_Pos              _U_(0)                                               /**< (HSMC_MODE1) Read Mode Position */
#define HSMC_MODE1_READ_MODE_Msk              (_U_(0x1) << HSMC_MODE1_READ_MODE_Pos)               /**< (HSMC_MODE1) Read Mode Mask */
#define HSMC_MODE1_READ_MODE(value)           (HSMC_MODE1_READ_MODE_Msk & ((value) << HSMC_MODE1_READ_MODE_Pos))
#define HSMC_MODE1_WRITE_MODE_Pos             _U_(1)                                               /**< (HSMC_MODE1) Write Mode Position */
#define HSMC_MODE1_WRITE_MODE_Msk             (_U_(0x1) << HSMC_MODE1_WRITE_MODE_Pos)              /**< (HSMC_MODE1) Write Mode Mask */
#define HSMC_MODE1_WRITE_MODE(value)          (HSMC_MODE1_WRITE_MODE_Msk & ((value) << HSMC_MODE1_WRITE_MODE_Pos))
#define HSMC_MODE1_RMW_ENABLE_Pos             _U_(2)                                               /**< (HSMC_MODE1) Read-Modify Write enable Position */
#define HSMC_MODE1_RMW_ENABLE_Msk             (_U_(0x1) << HSMC_MODE1_RMW_ENABLE_Pos)              /**< (HSMC_MODE1) Read-Modify Write enable Mask */
#define HSMC_MODE1_RMW_ENABLE(value)          (HSMC_MODE1_RMW_ENABLE_Msk & ((value) << HSMC_MODE1_RMW_ENABLE_Pos))
#define HSMC_MODE1_EXNW_MODE_Pos              _U_(4)                                               /**< (HSMC_MODE1) NWAIT Mode Position */
#define HSMC_MODE1_EXNW_MODE_Msk              (_U_(0x3) << HSMC_MODE1_EXNW_MODE_Pos)               /**< (HSMC_MODE1) NWAIT Mode Mask */
#define HSMC_MODE1_EXNW_MODE(value)           (HSMC_MODE1_EXNW_MODE_Msk & ((value) << HSMC_MODE1_EXNW_MODE_Pos))
#define   HSMC_MODE1_EXNW_MODE_DISABLED_Val   _U_(0x0)                                             /**< (HSMC_MODE1) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   HSMC_MODE1_EXNW_MODE_FROZEN_Val     _U_(0x2)                                             /**< (HSMC_MODE1) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE1_EXNW_MODE_READY_Val      _U_(0x3)                                             /**< (HSMC_MODE1) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE1_EXNW_MODE_DISABLED         (HSMC_MODE1_EXNW_MODE_DISABLED_Val << HSMC_MODE1_EXNW_MODE_Pos) /**< (HSMC_MODE1) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define HSMC_MODE1_EXNW_MODE_FROZEN           (HSMC_MODE1_EXNW_MODE_FROZEN_Val << HSMC_MODE1_EXNW_MODE_Pos) /**< (HSMC_MODE1) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE1_EXNW_MODE_READY            (HSMC_MODE1_EXNW_MODE_READY_Val << HSMC_MODE1_EXNW_MODE_Pos) /**< (HSMC_MODE1) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE1_DBW_Pos                    _U_(8)                                               /**< (HSMC_MODE1) Data Bus Width Position */
#define HSMC_MODE1_DBW_Msk                    (_U_(0x3) << HSMC_MODE1_DBW_Pos)                     /**< (HSMC_MODE1) Data Bus Width Mask */
#define HSMC_MODE1_DBW(value)                 (HSMC_MODE1_DBW_Msk & ((value) << HSMC_MODE1_DBW_Pos))
#define   HSMC_MODE1_DBW_8_BIT_Val            _U_(0x0)                                             /**< (HSMC_MODE1) 8-bit Data Bus  */
#define   HSMC_MODE1_DBW_16_BIT_Val           _U_(0x1)                                             /**< (HSMC_MODE1) 16-bit Data Bus  */
#define   HSMC_MODE1_DBW_32_BIT_Val           _U_(0x2)                                             /**< (HSMC_MODE1) 32-bit Data Bus  */
#define HSMC_MODE1_DBW_8_BIT                  (HSMC_MODE1_DBW_8_BIT_Val << HSMC_MODE1_DBW_Pos)     /**< (HSMC_MODE1) 8-bit Data Bus Position  */
#define HSMC_MODE1_DBW_16_BIT                 (HSMC_MODE1_DBW_16_BIT_Val << HSMC_MODE1_DBW_Pos)    /**< (HSMC_MODE1) 16-bit Data Bus Position  */
#define HSMC_MODE1_DBW_32_BIT                 (HSMC_MODE1_DBW_32_BIT_Val << HSMC_MODE1_DBW_Pos)    /**< (HSMC_MODE1) 32-bit Data Bus Position  */
#define HSMC_MODE1_Msk                        _U_(0x00000337)                                      /**< (HSMC_MODE1) Register Mask  */


/* -------- HSMC_SETUP2 : (HSMC Offset: 0x20) (R/W 32) HSMC Setup Register (CS_number = 2) -------- */
#define HSMC_SETUP2_NWE_SETUP_Pos             _U_(0)                                               /**< (HSMC_SETUP2) NWE Setup Length Position */
#define HSMC_SETUP2_NWE_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP2_NWE_SETUP_Pos)             /**< (HSMC_SETUP2) NWE Setup Length Mask */
#define HSMC_SETUP2_NWE_SETUP(value)          (HSMC_SETUP2_NWE_SETUP_Msk & ((value) << HSMC_SETUP2_NWE_SETUP_Pos))
#define HSMC_SETUP2_NCS_WR_SETUP_Pos          _U_(8)                                               /**< (HSMC_SETUP2) NCS Setup Length in WRITE Access Position */
#define HSMC_SETUP2_NCS_WR_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP2_NCS_WR_SETUP_Pos)          /**< (HSMC_SETUP2) NCS Setup Length in WRITE Access Mask */
#define HSMC_SETUP2_NCS_WR_SETUP(value)       (HSMC_SETUP2_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP2_NCS_WR_SETUP_Pos))
#define HSMC_SETUP2_NRD_SETUP_Pos             _U_(16)                                              /**< (HSMC_SETUP2) NRD Setup Length Position */
#define HSMC_SETUP2_NRD_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP2_NRD_SETUP_Pos)             /**< (HSMC_SETUP2) NRD Setup Length Mask */
#define HSMC_SETUP2_NRD_SETUP(value)          (HSMC_SETUP2_NRD_SETUP_Msk & ((value) << HSMC_SETUP2_NRD_SETUP_Pos))
#define HSMC_SETUP2_NCS_RD_SETUP_Pos          _U_(24)                                              /**< (HSMC_SETUP2) NCS Setup Length in READ Access Position */
#define HSMC_SETUP2_NCS_RD_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP2_NCS_RD_SETUP_Pos)          /**< (HSMC_SETUP2) NCS Setup Length in READ Access Mask */
#define HSMC_SETUP2_NCS_RD_SETUP(value)       (HSMC_SETUP2_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP2_NCS_RD_SETUP_Pos))
#define HSMC_SETUP2_Msk                       _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP2) Register Mask  */


