Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hsmc.h
/* -------- HSMC_PULSE3 : (HSMC Offset: 0x34) (R/W 32) HSMC Pulse Register (CS_number = 3) -------- */
#define HSMC_PULSE3_NWE_PULSE_Pos             _U_(0)                                               /**< (HSMC_PULSE3) NWE Pulse Length Position */
#define HSMC_PULSE3_NWE_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE3_NWE_PULSE_Pos)             /**< (HSMC_PULSE3) NWE Pulse Length Mask */
#define HSMC_PULSE3_NWE_PULSE(value)          (HSMC_PULSE3_NWE_PULSE_Msk & ((value) << HSMC_PULSE3_NWE_PULSE_Pos))
#define HSMC_PULSE3_NCS_WR_PULSE_Pos          _U_(8)                                               /**< (HSMC_PULSE3) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE3_NCS_WR_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE3_NCS_WR_PULSE_Pos)          /**< (HSMC_PULSE3) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE3_NCS_WR_PULSE(value)       (HSMC_PULSE3_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE3_NCS_WR_PULSE_Pos))
#define HSMC_PULSE3_NRD_PULSE_Pos             _U_(16)                                              /**< (HSMC_PULSE3) NRD Pulse Length Position */
#define HSMC_PULSE3_NRD_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE3_NRD_PULSE_Pos)             /**< (HSMC_PULSE3) NRD Pulse Length Mask */
#define HSMC_PULSE3_NRD_PULSE(value)          (HSMC_PULSE3_NRD_PULSE_Msk & ((value) << HSMC_PULSE3_NRD_PULSE_Pos))
#define HSMC_PULSE3_NCS_RD_PULSE_Pos          _U_(24)                                              /**< (HSMC_PULSE3) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE3_NCS_RD_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE3_NCS_RD_PULSE_Pos)          /**< (HSMC_PULSE3) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE3_NCS_RD_PULSE(value)       (HSMC_PULSE3_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE3_NCS_RD_PULSE_Pos))
#define HSMC_PULSE3_Msk                       _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE3) Register Mask  */


/* -------- HSMC_CYCLE3 : (HSMC Offset: 0x38) (R/W 32) HSMC Cycle Register (CS_number = 3) -------- */
#define HSMC_CYCLE3_NWE_CYCLE_Pos             _U_(0)                                               /**< (HSMC_CYCLE3) Total Write Cycle Length Position */
#define HSMC_CYCLE3_NWE_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE3_NWE_CYCLE_Pos)            /**< (HSMC_CYCLE3) Total Write Cycle Length Mask */
#define HSMC_CYCLE3_NWE_CYCLE(value)          (HSMC_CYCLE3_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE3_NWE_CYCLE_Pos))
#define HSMC_CYCLE3_NRD_CYCLE_Pos             _U_(16)                                              /**< (HSMC_CYCLE3) Total Read Cycle Length Position */
#define HSMC_CYCLE3_NRD_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE3_NRD_CYCLE_Pos)            /**< (HSMC_CYCLE3) Total Read Cycle Length Mask */
#define HSMC_CYCLE3_NRD_CYCLE(value)          (HSMC_CYCLE3_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE3_NRD_CYCLE_Pos))
#define HSMC_CYCLE3_Msk                       _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE3) Register Mask  */


/* -------- HSMC_MODE3 : (HSMC Offset: 0x3C) (R/W 32) HSMC Mode Register (CS_number = 3) -------- */
#define HSMC_MODE3_READ_MODE_Pos              _U_(0)                                               /**< (HSMC_MODE3) Read Mode Position */
#define HSMC_MODE3_READ_MODE_Msk              (_U_(0x1) << HSMC_MODE3_READ_MODE_Pos)               /**< (HSMC_MODE3) Read Mode Mask */
#define HSMC_MODE3_READ_MODE(value)           (HSMC_MODE3_READ_MODE_Msk & ((value) << HSMC_MODE3_READ_MODE_Pos))
#define HSMC_MODE3_WRITE_MODE_Pos             _U_(1)                                               /**< (HSMC_MODE3) Write Mode Position */
#define HSMC_MODE3_WRITE_MODE_Msk             (_U_(0x1) << HSMC_MODE3_WRITE_MODE_Pos)              /**< (HSMC_MODE3) Write Mode Mask */
#define HSMC_MODE3_WRITE_MODE(value)          (HSMC_MODE3_WRITE_MODE_Msk & ((value) << HSMC_MODE3_WRITE_MODE_Pos))
#define HSMC_MODE3_RMW_ENABLE_Pos             _U_(2)                                               /**< (HSMC_MODE3) Read-Modify Write enable Position */
#define HSMC_MODE3_RMW_ENABLE_Msk             (_U_(0x1) << HSMC_MODE3_RMW_ENABLE_Pos)              /**< (HSMC_MODE3) Read-Modify Write enable Mask */
#define HSMC_MODE3_RMW_ENABLE(value)          (HSMC_MODE3_RMW_ENABLE_Msk & ((value) << HSMC_MODE3_RMW_ENABLE_Pos))
#define HSMC_MODE3_EXNW_MODE_Pos              _U_(4)                                               /**< (HSMC_MODE3) NWAIT Mode Position */
#define HSMC_MODE3_EXNW_MODE_Msk              (_U_(0x3) << HSMC_MODE3_EXNW_MODE_Pos)               /**< (HSMC_MODE3) NWAIT Mode Mask */
#define HSMC_MODE3_EXNW_MODE(value)           (HSMC_MODE3_EXNW_MODE_Msk & ((value) << HSMC_MODE3_EXNW_MODE_Pos))
#define   HSMC_MODE3_EXNW_MODE_DISABLED_Val   _U_(0x0)                                             /**< (HSMC_MODE3) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   HSMC_MODE3_EXNW_MODE_FROZEN_Val     _U_(0x2)                                             /**< (HSMC_MODE3) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE3_EXNW_MODE_READY_Val      _U_(0x3)                                             /**< (HSMC_MODE3) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE3_EXNW_MODE_DISABLED         (HSMC_MODE3_EXNW_MODE_DISABLED_Val << HSMC_MODE3_EXNW_MODE_Pos) /**< (HSMC_MODE3) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define HSMC_MODE3_EXNW_MODE_FROZEN           (HSMC_MODE3_EXNW_MODE_FROZEN_Val << HSMC_MODE3_EXNW_MODE_Pos) /**< (HSMC_MODE3) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE3_EXNW_MODE_READY            (HSMC_MODE3_EXNW_MODE_READY_Val << HSMC_MODE3_EXNW_MODE_Pos) /**< (HSMC_MODE3) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE3_DBW_Pos                    _U_(8)                                               /**< (HSMC_MODE3) Data Bus Width Position */
#define HSMC_MODE3_DBW_Msk                    (_U_(0x3) << HSMC_MODE3_DBW_Pos)                     /**< (HSMC_MODE3) Data Bus Width Mask */
#define HSMC_MODE3_DBW(value)                 (HSMC_MODE3_DBW_Msk & ((value) << HSMC_MODE3_DBW_Pos))
#define   HSMC_MODE3_DBW_8_BIT_Val            _U_(0x0)                                             /**< (HSMC_MODE3) 8-bit Data Bus  */
#define   HSMC_MODE3_DBW_16_BIT_Val           _U_(0x1)                                             /**< (HSMC_MODE3) 16-bit Data Bus  */
#define   HSMC_MODE3_DBW_32_BIT_Val           _U_(0x2)                                             /**< (HSMC_MODE3) 32-bit Data Bus  */
#define HSMC_MODE3_DBW_8_BIT                  (HSMC_MODE3_DBW_8_BIT_Val << HSMC_MODE3_DBW_Pos)     /**< (HSMC_MODE3) 8-bit Data Bus Position  */
#define HSMC_MODE3_DBW_16_BIT                 (HSMC_MODE3_DBW_16_BIT_Val << HSMC_MODE3_DBW_Pos)    /**< (HSMC_MODE3) 16-bit Data Bus Position  */
#define HSMC_MODE3_DBW_32_BIT                 (HSMC_MODE3_DBW_32_BIT_Val << HSMC_MODE3_DBW_Pos)    /**< (HSMC_MODE3) 32-bit Data Bus Position  */
#define HSMC_MODE3_Msk                        _U_(0x00000337)                                      /**< (HSMC_MODE3) Register Mask  */


/* -------- HSMC_SETUP4 : (HSMC Offset: 0x40) (R/W 32) HSMC Setup Register (CS_number = 4) -------- */
#define HSMC_SETUP4_NWE_SETUP_Pos             _U_(0)                                               /**< (HSMC_SETUP4) NWE Setup Length Position */
#define HSMC_SETUP4_NWE_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP4_NWE_SETUP_Pos)             /**< (HSMC_SETUP4) NWE Setup Length Mask */
#define HSMC_SETUP4_NWE_SETUP(value)          (HSMC_SETUP4_NWE_SETUP_Msk & ((value) << HSMC_SETUP4_NWE_SETUP_Pos))
#define HSMC_SETUP4_NCS_WR_SETUP_Pos          _U_(8)                                               /**< (HSMC_SETUP4) NCS Setup Length in WRITE Access Position */
#define HSMC_SETUP4_NCS_WR_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP4_NCS_WR_SETUP_Pos)          /**< (HSMC_SETUP4) NCS Setup Length in WRITE Access Mask */
#define HSMC_SETUP4_NCS_WR_SETUP(value)       (HSMC_SETUP4_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP4_NCS_WR_SETUP_Pos))
#define HSMC_SETUP4_NRD_SETUP_Pos             _U_(16)                                              /**< (HSMC_SETUP4) NRD Setup Length Position */
#define HSMC_SETUP4_NRD_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP4_NRD_SETUP_Pos)             /**< (HSMC_SETUP4) NRD Setup Length Mask */
#define HSMC_SETUP4_NRD_SETUP(value)          (HSMC_SETUP4_NRD_SETUP_Msk & ((value) << HSMC_SETUP4_NRD_SETUP_Pos))
#define HSMC_SETUP4_NCS_RD_SETUP_Pos          _U_(24)                                              /**< (HSMC_SETUP4) NCS Setup Length in READ Access Position */
#define HSMC_SETUP4_NCS_RD_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP4_NCS_RD_SETUP_Pos)          /**< (HSMC_SETUP4) NCS Setup Length in READ Access Mask */
#define HSMC_SETUP4_NCS_RD_SETUP(value)       (HSMC_SETUP4_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP4_NCS_RD_SETUP_Pos))
#define HSMC_SETUP4_Msk                       _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP4) Register Mask  */


/* -------- HSMC_PULSE4 : (HSMC Offset: 0x44) (R/W 32) HSMC Pulse Register (CS_number = 4) -------- */
#define HSMC_PULSE4_NWE_PULSE_Pos             _U_(0)                                               /**< (HSMC_PULSE4) NWE Pulse Length Position */
#define HSMC_PULSE4_NWE_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE4_NWE_PULSE_Pos)             /**< (HSMC_PULSE4) NWE Pulse Length Mask */
#define HSMC_PULSE4_NWE_PULSE(value)          (HSMC_PULSE4_NWE_PULSE_Msk & ((value) << HSMC_PULSE4_NWE_PULSE_Pos))
#define HSMC_PULSE4_NCS_WR_PULSE_Pos          _U_(8)                                               /**< (HSMC_PULSE4) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE4_NCS_WR_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE4_NCS_WR_PULSE_Pos)          /**< (HSMC_PULSE4) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE4_NCS_WR_PULSE(value)       (HSMC_PULSE4_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE4_NCS_WR_PULSE_Pos))
#define HSMC_PULSE4_NRD_PULSE_Pos             _U_(16)                                              /**< (HSMC_PULSE4) NRD Pulse Length Position */
#define HSMC_PULSE4_NRD_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE4_NRD_PULSE_Pos)             /**< (HSMC_PULSE4) NRD Pulse Length Mask */
#define HSMC_PULSE4_NRD_PULSE(value)          (HSMC_PULSE4_NRD_PULSE_Msk & ((value) << HSMC_PULSE4_NRD_PULSE_Pos))
#define HSMC_PULSE4_NCS_RD_PULSE_Pos          _U_(24)                                              /**< (HSMC_PULSE4) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE4_NCS_RD_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE4_NCS_RD_PULSE_Pos)          /**< (HSMC_PULSE4) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE4_NCS_RD_PULSE(value)       (HSMC_PULSE4_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE4_NCS_RD_PULSE_Pos))
#define HSMC_PULSE4_Msk                       _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE4) Register Mask  */


/* -------- HSMC_CYCLE4 : (HSMC Offset: 0x48) (R/W 32) HSMC Cycle Register (CS_number = 4) -------- */
#define HSMC_CYCLE4_NWE_CYCLE_Pos             _U_(0)                                               /**< (HSMC_CYCLE4) Total Write Cycle Length Position */
#define HSMC_CYCLE4_NWE_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE4_NWE_CYCLE_Pos)            /**< (HSMC_CYCLE4) Total Write Cycle Length Mask */
#define HSMC_CYCLE4_NWE_CYCLE(value)          (HSMC_CYCLE4_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE4_NWE_CYCLE_Pos))
#define HSMC_CYCLE4_NRD_CYCLE_Pos             _U_(16)                                              /**< (HSMC_CYCLE4) Total Read Cycle Length Position */
#define HSMC_CYCLE4_NRD_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE4_NRD_CYCLE_Pos)            /**< (HSMC_CYCLE4) Total Read Cycle Length Mask */
#define HSMC_CYCLE4_NRD_CYCLE(value)          (HSMC_CYCLE4_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE4_NRD_CYCLE_Pos))
#define HSMC_CYCLE4_Msk                       _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE4) Register Mask  */


/* -------- HSMC_MODE4 : (HSMC Offset: 0x4C) (R/W 32) HSMC Mode Register (CS_number = 4) -------- */
#define HSMC_MODE4_READ_MODE_Pos              _U_(0)                                               /**< (HSMC_MODE4) Read Mode Position */
#define HSMC_MODE4_READ_MODE_Msk              (_U_(0x1) << HSMC_MODE4_READ_MODE_Pos)               /**< (HSMC_MODE4) Read Mode Mask */
#define HSMC_MODE4_READ_MODE(value)           (HSMC_MODE4_READ_MODE_Msk & ((value) << HSMC_MODE4_READ_MODE_Pos))
#define HSMC_MODE4_WRITE_MODE_Pos             _U_(1)                                               /**< (HSMC_MODE4) Write Mode Position */
#define HSMC_MODE4_WRITE_MODE_Msk             (_U_(0x1) << HSMC_MODE4_WRITE_MODE_Pos)              /**< (HSMC_MODE4) Write Mode Mask */
#define HSMC_MODE4_WRITE_MODE(value)          (HSMC_MODE4_WRITE_MODE_Msk & ((value) << HSMC_MODE4_WRITE_MODE_Pos))
#define HSMC_MODE4_RMW_ENABLE_Pos             _U_(2)                                               /**< (HSMC_MODE4) Read-Modify Write enable Position */
#define HSMC_MODE4_RMW_ENABLE_Msk             (_U_(0x1) << HSMC_MODE4_RMW_ENABLE_Pos)              /**< (HSMC_MODE4) Read-Modify Write enable Mask */
#define HSMC_MODE4_RMW_ENABLE(value)          (HSMC_MODE4_RMW_ENABLE_Msk & ((value) << HSMC_MODE4_RMW_ENABLE_Pos))
#define HSMC_MODE4_EXNW_MODE_Pos              _U_(4)                                               /**< (HSMC_MODE4) NWAIT Mode Position */
#define HSMC_MODE4_EXNW_MODE_Msk              (_U_(0x3) << HSMC_MODE4_EXNW_MODE_Pos)               /**< (HSMC_MODE4) NWAIT Mode Mask */
#define HSMC_MODE4_EXNW_MODE(value)           (HSMC_MODE4_EXNW_MODE_Msk & ((value) << HSMC_MODE4_EXNW_MODE_Pos))
#define   HSMC_MODE4_EXNW_MODE_DISABLED_Val   _U_(0x0)                                             /**< (HSMC_MODE4) Disabled-The NWAIT input signal is ignored on the corresponding chip select.  */
#define   HSMC_MODE4_EXNW_MODE_FROZEN_Val     _U_(0x2)                                             /**< (HSMC_MODE4) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE4_EXNW_MODE_READY_Val      _U_(0x3)                                             /**< (HSMC_MODE4) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE4_EXNW_MODE_DISABLED         (HSMC_MODE4_EXNW_MODE_DISABLED_Val << HSMC_MODE4_EXNW_MODE_Pos) /**< (HSMC_MODE4) Disabled-The NWAIT input signal is ignored on the corresponding chip select. Position  */
#define HSMC_MODE4_EXNW_MODE_FROZEN           (HSMC_MODE4_EXNW_MODE_FROZEN_Val << HSMC_MODE4_EXNW_MODE_Pos) /**< (HSMC_MODE4) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE4_EXNW_MODE_READY            (HSMC_MODE4_EXNW_MODE_READY_Val << HSMC_MODE4_EXNW_MODE_Pos) /**< (HSMC_MODE4) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE4_DBW_Pos                    _U_(8)                                               /**< (HSMC_MODE4) Data Bus Width Position */
#define HSMC_MODE4_DBW_Msk                    (_U_(0x3) << HSMC_MODE4_DBW_Pos)                     /**< (HSMC_MODE4) Data Bus Width Mask */
#define HSMC_MODE4_DBW(value)                 (HSMC_MODE4_DBW_Msk & ((value) << HSMC_MODE4_DBW_Pos))
#define   HSMC_MODE4_DBW_8_BIT_Val            _U_(0x0)                                             /**< (HSMC_MODE4) 8-bit Data Bus  */
#define   HSMC_MODE4_DBW_16_BIT_Val           _U_(0x1)                                             /**< (HSMC_MODE4) 16-bit Data Bus  */
#define   HSMC_MODE4_DBW_32_BIT_Val           _U_(0x2)                                             /**< (HSMC_MODE4) 32-bit Data Bus  */
#define HSMC_MODE4_DBW_8_BIT                  (HSMC_MODE4_DBW_8_BIT_Val << HSMC_MODE4_DBW_Pos)     /**< (HSMC_MODE4) 8-bit Data Bus Position  */
#define HSMC_MODE4_DBW_16_BIT                 (HSMC_MODE4_DBW_16_BIT_Val << HSMC_MODE4_DBW_Pos)    /**< (HSMC_MODE4) 16-bit Data Bus Position  */
#define HSMC_MODE4_DBW_32_BIT                 (HSMC_MODE4_DBW_32_BIT_Val << HSMC_MODE4_DBW_Pos)    /**< (HSMC_MODE4) 32-bit Data Bus Position  */
#define HSMC_MODE4_Msk                        _U_(0x00000337)                                      /**< (HSMC_MODE4) Register Mask  */


/* -------- HSMC_SETUP5 : (HSMC Offset: 0x50) (R/W 32) HSMC Setup Register (CS_number = 5) -------- */
#define HSMC_SETUP5_NWE_SETUP_Pos             _U_(0)                                               /**< (HSMC_SETUP5) NWE Setup Length Position */
#define HSMC_SETUP5_NWE_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP5_NWE_SETUP_Pos)             /**< (HSMC_SETUP5) NWE Setup Length Mask */
#define HSMC_SETUP5_NWE_SETUP(value)          (HSMC_SETUP5_NWE_SETUP_Msk & ((value) << HSMC_SETUP5_NWE_SETUP_Pos))
#define HSMC_SETUP5_NCS_WR_SETUP_Pos          _U_(8)                                               /**< (HSMC_SETUP5) NCS Setup Length in WRITE Access Position */
#define HSMC_SETUP5_NCS_WR_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP5_NCS_WR_SETUP_Pos)          /**< (HSMC_SETUP5) NCS Setup Length in WRITE Access Mask */
#define HSMC_SETUP5_NCS_WR_SETUP(value)       (HSMC_SETUP5_NCS_WR_SETUP_Msk & ((value) << HSMC_SETUP5_NCS_WR_SETUP_Pos))
#define HSMC_SETUP5_NRD_SETUP_Pos             _U_(16)                                              /**< (HSMC_SETUP5) NRD Setup Length Position */
#define HSMC_SETUP5_NRD_SETUP_Msk             (_U_(0x3F) << HSMC_SETUP5_NRD_SETUP_Pos)             /**< (HSMC_SETUP5) NRD Setup Length Mask */
#define HSMC_SETUP5_NRD_SETUP(value)          (HSMC_SETUP5_NRD_SETUP_Msk & ((value) << HSMC_SETUP5_NRD_SETUP_Pos))
#define HSMC_SETUP5_NCS_RD_SETUP_Pos          _U_(24)                                              /**< (HSMC_SETUP5) NCS Setup Length in READ Access Position */
#define HSMC_SETUP5_NCS_RD_SETUP_Msk          (_U_(0x3F) << HSMC_SETUP5_NCS_RD_SETUP_Pos)          /**< (HSMC_SETUP5) NCS Setup Length in READ Access Mask */
#define HSMC_SETUP5_NCS_RD_SETUP(value)       (HSMC_SETUP5_NCS_RD_SETUP_Msk & ((value) << HSMC_SETUP5_NCS_RD_SETUP_Pos))
#define HSMC_SETUP5_Msk                       _U_(0x3F3F3F3F)                                      /**< (HSMC_SETUP5) Register Mask  */


/* -------- HSMC_PULSE5 : (HSMC Offset: 0x54) (R/W 32) HSMC Pulse Register (CS_number = 5) -------- */
#define HSMC_PULSE5_NWE_PULSE_Pos             _U_(0)                                               /**< (HSMC_PULSE5) NWE Pulse Length Position */
#define HSMC_PULSE5_NWE_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE5_NWE_PULSE_Pos)             /**< (HSMC_PULSE5) NWE Pulse Length Mask */
#define HSMC_PULSE5_NWE_PULSE(value)          (HSMC_PULSE5_NWE_PULSE_Msk & ((value) << HSMC_PULSE5_NWE_PULSE_Pos))
#define HSMC_PULSE5_NCS_WR_PULSE_Pos          _U_(8)                                               /**< (HSMC_PULSE5) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE5_NCS_WR_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE5_NCS_WR_PULSE_Pos)          /**< (HSMC_PULSE5) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE5_NCS_WR_PULSE(value)       (HSMC_PULSE5_NCS_WR_PULSE_Msk & ((value) << HSMC_PULSE5_NCS_WR_PULSE_Pos))
#define HSMC_PULSE5_NRD_PULSE_Pos             _U_(16)                                              /**< (HSMC_PULSE5) NRD Pulse Length Position */
#define HSMC_PULSE5_NRD_PULSE_Msk             (_U_(0x7F) << HSMC_PULSE5_NRD_PULSE_Pos)             /**< (HSMC_PULSE5) NRD Pulse Length Mask */
#define HSMC_PULSE5_NRD_PULSE(value)          (HSMC_PULSE5_NRD_PULSE_Msk & ((value) << HSMC_PULSE5_NRD_PULSE_Pos))
#define HSMC_PULSE5_NCS_RD_PULSE_Pos          _U_(24)                                              /**< (HSMC_PULSE5) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE5_NCS_RD_PULSE_Msk          (_U_(0x7F) << HSMC_PULSE5_NCS_RD_PULSE_Pos)          /**< (HSMC_PULSE5) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE5_NCS_RD_PULSE(value)       (HSMC_PULSE5_NCS_RD_PULSE_Msk & ((value) << HSMC_PULSE5_NCS_RD_PULSE_Pos))
#define HSMC_PULSE5_Msk                       _U_(0x7F7F7F7F)                                      /**< (HSMC_PULSE5) Register Mask  */


/* -------- HSMC_CYCLE5 : (HSMC Offset: 0x58) (R/W 32) HSMC Cycle Register (CS_number = 5) -------- */
#define HSMC_CYCLE5_NWE_CYCLE_Pos             _U_(0)                                               /**< (HSMC_CYCLE5) Total Write Cycle Length Position */
#define HSMC_CYCLE5_NWE_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE5_NWE_CYCLE_Pos)            /**< (HSMC_CYCLE5) Total Write Cycle Length Mask */
#define HSMC_CYCLE5_NWE_CYCLE(value)          (HSMC_CYCLE5_NWE_CYCLE_Msk & ((value) << HSMC_CYCLE5_NWE_CYCLE_Pos))
#define HSMC_CYCLE5_NRD_CYCLE_Pos             _U_(16)                                              /**< (HSMC_CYCLE5) Total Read Cycle Length Position */
#define HSMC_CYCLE5_NRD_CYCLE_Msk             (_U_(0x1FF) << HSMC_CYCLE5_NRD_CYCLE_Pos)            /**< (HSMC_CYCLE5) Total Read Cycle Length Mask */
#define HSMC_CYCLE5_NRD_CYCLE(value)          (HSMC_CYCLE5_NRD_CYCLE_Msk & ((value) << HSMC_CYCLE5_NRD_CYCLE_Pos))
#define HSMC_CYCLE5_Msk                       _U_(0x01FF01FF)                                      /**< (HSMC_CYCLE5) Register Mask  */


